/*
    ОСНОВЫ ПРОГРАММИРОВАНИЯ на Java.
(тут я буду пытаться впендюривать по несколько глав, т.к. они маленькие.)
*/

//----------------------------------------------------------------------------------------------------------------------\\

/* Структура программы. */

// 1) Выполнение программы. Метод main:

public class Program {
 // Тут всё как в 'Rust', то есть входной точкой в программу является метод main:  ( только в 'Rust' это функция :] )
 // Единственное, чем отличается main Джавы, так это тем,
 // что заголовок может быть только таким:
    public static void main(String args[]) {    // в 'Rust' же можно менять функцию так, чтобы она возвращала какое-нибудь значение, но сейчас не об этом))
        System.out.println("Hello, JAVA! :D");
    }
}


// 2) Комментарии:
// Ну тут всё ясно.

//----------------------------------------------------------------------------------------------------------------------\\